sslivins/bala2fire/sdkconfig.defaults
# M5Stack Fire / Bala2 Fire defaults
CONFIG_IDF_TARGET="esp32"

# 16 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 4 MB PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Higher CPU clock for balancing loop
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# C++ exceptions off (M5Unified uses RTTI but not exceptions)
CONFIG_COMPILER_CXX_RTTI=y

# 1 kHz FreeRTOS tick so the 200 Hz balancer loop has 5 ms resolution.
# (Default is 100 Hz, which rounds pdMS_TO_TICKS(5) to 0 ticks.)
CONFIG_FREERTOS_HZ=1000

# Flip angle PID direction: verified on-hardware that tilting forward
# drove the wheels INTO the fall with the default (-1) direction.
CONFIG_BALANCER_ANGLE_DIR_POS=y

# OTA partition layout (two ~3 MB app slots + 10 MB FAT) so we can flash
# new firmware over Wi-Fi via components/bala2_ota.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable rollback so a broken OTA reboots into the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA streams a ~1 MB POST body; allow generous HTTP recv timeouts and
# a slightly bigger HTTP server stack.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
